Revit 2027 API
PartMakerMethodToDivideVolumes.DivisionRuleId Property
 Id of the 'DivisionRule' which is used to augment the cutting sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DivisionRuleId { get; set; }
Public Property DivisionRuleId As ElementId
	Get
	Set
public:
property ElementId^ DivisionRuleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DivisionRuleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The provided element id cannot be assigned as a division rule to this PartMakerMethodToDivideVolumes.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace